cjacker/opensource-toolchain-8051/headers/stc8hxx.h
#define MD3 (*(unsigned char volatile __xdata *)0xfcf0)
#define MD2 (*(unsigned char volatile __xdata *)0xfcf1)
#define MD1 (*(unsigned char volatile __xdata *)0xfcf2)
#define MD0 (*(unsigned char volatile __xdata *)0xfcf3)
#define MD5 (*(unsigned char volatile __xdata *)0xfcf4)
#define MD4 (*(unsigned char volatile __xdata *)0xfcf5)
#define ARCON (*(unsigned char volatile __xdata *)0xfcf6)
#define OPCON (*(unsigned char volatile __xdata *)0xfcf7)

/////////////////////////////////////////////////
//FB00H-FBFFH
/////////////////////////////////////////////////

#define COMEN (*(unsigned char volatile __xdata *)0xfb00)
#define SEGENL (*(unsigned char volatile __xdata *)0xfb01)
#define SEGENH (*(unsigned char volatile __xdata *)0xfb02)
#define LEDCTRL (*(unsigned char volatile __xdata *)0xfb03)
#define LEDCKS (*(unsigned char volatile __xdata *)0xfb04)
#define COM0_DA_L (*(unsigned char volatile __xdata *)0xfb10)
#define COM1_DA_L (*(unsigned char volatile __xdata *)0xfb11)
#define COM2_DA_L (*(unsigned char volatile __xdata *)0xfb12)
#define COM3_DA_L (*(unsigned char volatile __xdata *)0xfb13)
#define COM4_DA_L (*(unsigned char volatile __xdata *)0xfb14)
#define COM5_DA_L (*(unsigned char volatile __xdata *)0xfb15)
#define COM6_DA_L (*(unsigned char volatile __xdata *)0xfb16)
#define COM7_DA_L (*(unsigned char volatile __xdata *)0xfb17)
#define COM0_DA_H (*(unsigned char volatile __xdata *)0xfb18)
#define COM1_DA_H (*(unsigned char volatile __xdata *)0xfb19)
#define COM2_DA_H (*(unsigned char volatile __xdata *)0xfb1a)
#define COM3_DA_H (*(unsigned char volatile __xdata *)0xfb1b)
#define COM4_DA_H (*(unsigned char volatile __xdata *)0xfb1c)
#define COM5_DA_H (*(unsigned char volatile __xdata *)0xfb1d)
#define COM6_DA_H (*(unsigned char volatile __xdata *)0xfb1e)
#define COM7_DA_H (*(unsigned char volatile __xdata *)0xfb1f)
#define COM0_DC_L (*(unsigned char volatile __xdata *)0xfb20)
#define COM1_DC_L (*(unsigned char volatile __xdata *)0xfb21)
#define COM2_DC_L (*(unsigned char volatile __xdata *)0xfb22)
#define COM3_DC_L (*(unsigned char volatile __xdata *)0xfb23)
#define COM4_DC_L (*(unsigned char volatile __xdata *)0xfb24)
#define COM5_DC_L (*(unsigned char volatile __xdata *)0xfb25)
#define COM6_DC_L (*(unsigned char volatile __xdata *)0xfb26)
#define COM7_DC_L (*(unsigned char volatile __xdata *)0xfb27)
#define COM0_DC_H (*(unsigned char volatile __xdata *)0xfb28)
#define COM1_DC_H (*(unsigned char volatile __xdata *)0xfb29)
#define COM2_DC_H (*(unsigned char volatile __xdata *)0xfb2a)
#define COM3_DC_H (*(unsigned char volatile __xdata *)0xfb2b)
#define COM4_DC_H (*(unsigned char volatile __xdata *)0xfb2c)
#define COM5_DC_H (*(unsigned char volatile __xdata *)0xfb2d)
#define COM6_DC_H (*(unsigned char volatile __xdata *)0xfb2e)
#define COM7_DC_H (*(unsigned char volatile __xdata *)0xfb2f)

#define TSCHEN1 (*(unsigned char volatile __xdata *)0xfb40)
#define TSCHEN2 (*(unsigned char volatile __xdata *)0xfb41)
#define TSCFG1 (*(unsigned char volatile __xdata *)0xfb42)
#define TSCFG2 (*(unsigned char volatile __xdata *)0xfb43)
#define TSWUTC (*(unsigned char volatile __xdata *)0xfb44)
#define TSCTRL (*(unsigned char volatile __xdata *)0xfb45)
#define TSSTA1 (*(unsigned char volatile __xdata *)0xfb46)
#define TSSTA2 (*(unsigned char volatile __xdata *)0xfb47)
#define TSRT (*(unsigned char volatile __xdata *)0xfb48)
#define TSDAT (*(unsigned int volatile __xdata *)0xfb49)
#define TSDATH (*(unsigned char volatile __xdata *)0xfb49)
#define TSDATL (*(unsigned char volatile __xdata *)0xfb4A)
#define TSTH00 (*(unsigned int volatile __xdata *)0xfb50)
#define TSTH00H (*(unsigned char volatile __xdata *)0xfb50)
#define TSTH00L (*(unsigned char volatile __xdata *)0xfb51)
#define TSTH01 (*(unsigned int volatile __xdata *)0xfb52)
#define TSTH01H (*(unsigned char volatile __xdata *)0xfb52)
#define TSTH01L (*(unsigned char volatile __xdata *)0xfb53)
#define TSTH02 (*(unsigned int volatile __xdata *)0xfb54)
#define TSTH02H (*(unsigned char volatile __xdata *)0xfb54)
#define TSTH02L (*(unsigned char volatile __xdata *)0xfb55)
#define TSTH03 (*(unsigned int volatile __xdata *)0xfb56)
#define TSTH03H (*(unsigned char volatile __xdata *)0xfb56)
#define TSTH03L (*(unsigned char volatile __xdata *)0xfb57)
#define TSTH04 (*(unsigned int volatile __xdata *)0xfb58)
#define TSTH04H (*(unsigned char volatile __xdata *)0xfb58)
#define TSTH04L (*(unsigned char volatile __xdata *)0xfb59)
#define TSTH05 (*(unsigned int volatile __xdata *)0xfb5a)
#define TSTH05H (*(unsigned char volatile __xdata *)0xfb5a)
#define TSTH05L (*(unsigned char volatile __xdata *)0xfb5b)
#define TSTH06 (*(unsigned int volatile __xdata *)0xfb5c)
#define TSTH06H (*(unsigned char volatile __xdata *)0xfb5c)
#define TSTH06L (*(unsigned char volatile __xdata *)0xfb5d)
#define TSTH07 (*(unsigned int volatile __xdata *)0xfb5e)
#define TSTH07H (*(unsigned char volatile __xdata *)0xfb5e)
#define TSTH07L (*(unsigned char volatile __xdata *)0xfb5f)
#define TSTH08 (*(unsigned int volatile __xdata *)0xfb60)
#define TSTH08H (*(unsigned char volatile __xdata *)0xfb60)
#define TSTH08L (*(unsigned char volatile __xdata *)0xfb61)
#define TSTH09 (*(unsigned int volatile __xdata *)0xfb62)
#define TSTH09H (*(unsigned char volatile __xdata *)0xfb62)
#define TSTH09L (*(unsigned char volatile __xdata *)0xfb63)
#define TSTH10 (*(unsigned int volatile __xdata *)0xfb64)
#define TSTH10H (*(unsigned char volatile __xdata *)0xfb64)
#define TSTH10L (*(unsigned char volatile __xdata *)0xfb65)
#define TSTH11 (*(unsigned int volatile __xdata *)0xfb66)
#define TSTH11H (*(unsigned char volatile __xdata *)0xfb66)
#define TSTH11L (*(unsigned char volatile __xdata *)0xfb67)
#define TSTH12 (*(unsigned int volatile __xdata *)0xfb68)
#define TSTH12H (*(unsigned char volatile __xdata *)0xfb68)
#define TSTH12L (*(unsigned char volatile __xdata *)0xfb69)
#define TSTH13 (*(unsigned int volatile __xdata *)0xfb6a)
#define TSTH13H (*(unsigned char volatile __xdata *)0xfb6a)
#define TSTH13L (*(unsigned char volatile __xdata *)0xfb6b)
#define TSTH14 (*(unsigned int volatile __xdata *)0xfb6c)
#define TSTH14H (*(unsigned char volatile __xdata *)0xfb6c)
#define TSTH14L (*(unsigned char volatile __xdata *)0xfb6d)
#define TSTH15 (*(unsigned int volatile __xdata *)0xfb6e)
#define TSTH15H (*(unsigned char volatile __xdata *)0xfb6e)
#define TSTH15L (*(unsigned char volatile __xdata *)0xfb6f)

/////////////////////////////////////////////////
//FA00H-FAFFH
/////////////////////////////////////////////////

#define DMA_ADC_CFG (*(unsigned char volatile __xdata *)0xfa10)
#define DMA_ADC_CR (*(unsigned char volatile __xdata *)0xfa11)
#define DMA_ADC_STA (*(unsigned char volatile __xdata *)0xfa12)
#define DMA_ADC_RXA (*(unsigned int volatile __xdata *)0xfa17)
#define DMA_ADC_RXAH (*(unsigned char volatile __xdata *)0xfa17)
#define DMA_ADC_RXAL (*(unsigned char volatile __xdata *)0xfa18)
#define DMA_ADC_CFG2 (*(unsigned char volatile __xdata *)0xfa19)
#define DMA_ADC_CHSW0 (*(unsigned char volatile __xdata *)0xfa1a)
#define DMA_ADC_CHSW1 (*(unsigned char volatile __xdata *)0xfa1b)

